In [1]:
import pandas as pd
import numpy as np

In [2]:
# Employee basic info
employees = pd.DataFrame({
    "EmpID": [1,2,3,4,5],
    "Name": ["Aman","Riya","Kunal","Sneha","Vikram"],
    "DeptID": [101,102,101,103,102]
})

# Department details
departments = pd.DataFrame({
    "DeptID": [101,102,103],
    "Department": ["IT","HR","Finance"]
})

# Salary details
salary = pd.DataFrame({
    "EmpID": [1,2,3,5,6],
    "Salary": [50000,48000,62000,45000,70000]
})

In [3]:
# Concatenate columns side-by-side
new_employees = pd.DataFrame({
    "EmpID": [6,7],
    "Name": ["Pooja","Rahul"],
    "DeptID": [101,103]
})

emp = pd.concat([employees,new_employees],axis=0)
emp.reset_index(drop=True)

   EmpID    Name  DeptID
0      1    Aman     101
1      2    Riya     102
2      3   Kunal     101
3      4   Sneha     103
4      5  Vikram     102
5      6   Pooja     101
6      7   Rahul     103

In [8]:
# Concatenate columns side-by-side
extra_info = pd.DataFrame({
    "Age": [22,25,24,28,26]
})
emp1 = pd.concat([emp.reset_index(drop=True),
           extra_info.reset_index(drop=True)], axis=1)

In [ ]:
# inner join emp1 and departments
# Show EmpID, Name, Department
emp2 = pd.merge(emp1,departments, on="DeptID",how="inner")

In [20]:
# Left join employees with salary

# Keep all employees
# Missing salary should show NaN
emp3= pd.merge(emp2,salary,on="EmpID",how="left")
emp3

   EmpID    Name  DeptID   Age Department   Salary
0      1    Aman     101  22.0         IT  50000.0
1      2    Riya     102  25.0         HR  48000.0
2      3   Kunal     101  24.0         IT  62000.0
3      4   Sneha     103  28.0    Finance      NaN
4      5  Vikram     102  26.0         HR  45000.0
5      6   Pooja     101   NaN         IT  70000.0
6      7   Rahul     103   NaN    Finance      NaN

In [24]:
# fter merging employees + departments + salary
# Create a final DataFrame with:
# Name
# Department
# Salary
result = emp3[["Name", "Department","Salary"]]
print(result)

     Name Department   Salary
0    Aman         IT  50000.0
1    Riya         HR  48000.0
2   Kunal         IT  62000.0
3   Sneha    Finance      NaN
4  Vikram         HR  45000.0
5   Pooja         IT  70000.0
6   Rahul    Finance      NaN

In [26]:
result.fillna(result["Salary"].median(),inplace=True)
result

/var/folders/r7/f95gykkj207bjlzqqdrkl7d40000gn/T/ipykernel_38776/797659195.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  result.fillna(result["Salary"].median(),inplace=True)

     Name Department   Salary
0    Aman         IT  50000.0
1    Riya         HR  48000.0
2   Kunal         IT  62000.0
3   Sneha    Finance  55000.0
4  Vikram         HR  45000.0
5   Pooja         IT  70000.0
6   Rahul    Finance  55000.0

In [ ]:
# Find departments where any employee salary > 60000
# result.loc[result["Salary"]>60000,"Department"].unique()
result.groupby("Department")["Salary"].max()>60000

Department
Finance    False
HR         False
IT          True
Name: Salary, dtype: bool

In [35]:
# Count number of employees in each department
result.groupby("Department")["Name"].count()

Department
Finance    2
HR         2
IT         3
Name: Name, dtype: int64

In [37]:
result["Department"].value_counts()  #another method to solve this same question

Department
IT         3
HR         2
Finance    2
Name: count, dtype: int64